# Movies Database part 2

In [1]:
import pandas as pd

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists,create_database
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/csbro/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

## Calculate max string lengths for object columns

### Basics

In [3]:
basics_df=pd.read_csv('data/basics-filter.csv')
basics_df.info()
basics_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86972 entries, 0 to 86971
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86972 non-null  int64
 1   tconst          86972 non-null  object
 2   titleType       86972 non-null  object
 3   primaryTitle    86972 non-null  object
 4   originalTitle   86972 non-null  object
 5   isAdult         86972 non-null  int64
 6   startYear       86972 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86972 non-null  int64
 9   genres          86972 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61111,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67485,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,67663,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,86790,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [6]:
ttype_len = basics_df['titleType'].fillna("").map(len).max()
ttype_len

5

In [7]:
ptype_len = basics_df['primaryTitle'].fillna("").map(len).max()
ptype_len

242

In [8]:
otitle_len = basics_df['originalTitle'].fillna("").map(len).max()
otitle_len

242

In [9]:
genre_len = basics_df['genres'].fillna("").map(len).max()
genre_len

29

### Ratings

In [10]:
ratings_df=pd.read_csv('data/ratings-filter.csv')
ratings_df.info()
ratings_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71904 entries, 0 to 71903
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     71904 non-null  int64
 1   tconst         71904 non-null  object
 2   averageRating  71904 non-null  float64
 3   numVotes       71904 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 2.2+ MB

   Unnamed: 0     tconst  averageRating  numVotes
0       17961  tt0035423            6.4     87153
1       40764  tt0062336            6.4       175
2       46487  tt0068865            5.4        74
3       46645  tt0069049            6.7      7754
4       63640  tt0088751            5.2       336

In [11]:
tconstr_len = ratings_df['tconst'].fillna("").map(len).max()
tconstr_len

10

## Movies ERD

![png](data/moviesERD.png)

In [2]:
db_name = 'movies'
conn = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/{db_name}"
engine = create_engine(conn, pool_pre_ping=True)

NameError: name 'login' is not defined

In [13]:
#Preview names of tables
q ="""
SHOW TABLES;
"""
pd.read_sql(q,engine)

  Tables_in_movies
0           basics
1           genres
2          ratings
3     title_genres

In [14]:
#Check if db exists
if database_exists(conn):
    print("It exists!")
else:
    create_database(conn)
    print('Database created')

It exists!

## Preparing data and Importing

#### Basics tables

In [15]:

q = """
DESCRIBE basics;
"""
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,char(15),NO,PRI,None,
1,primary_title,varchar(250),YES,,None,
2,start_year,float,YES,,None,
3,runtime_mins,int,YES,,None,
4,created_date,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_date,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

#### Checking columns and names

In [16]:
#checking field names
describe['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime_mins',
       'created_date', 'updated_date'], dtype=object)

In [17]:
#checking dataframe's columns
basics_df.columns

Index(['Unnamed: 0', 'tconst', 'titleType', 'primaryTitle', 'originalTitle',
       'isAdult', 'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [18]:
#Drop unused columns
basics_df.drop(columns= ['Unnamed: 0', 'titleType', 'originalTitle', 'isAdult', 'endYear', 'genres'], 
            inplace = True, axis = 1)
basics_df.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes'], dtype='object')

In [19]:
#Rename column so names match
rename_basics = {'primaryTitle':'primary_title', 'startYear':'start_year', 'runtimeMinutes':'runtime_mins'}
basics_df = basics_df.rename(rename_basics, axis = 1)
basics_df.head(1)

      tconst   primary_title  start_year  runtime_mins
0  tt0035423  Kate & Leopold      2001.0           118

#### Review Data Types

In [20]:
#Review SQL table data types
describe [['Field', 'Type']]

           Field          Type
0         tconst      char(15)
1  primary_title  varchar(250)
2     start_year         float
3   runtime_mins           int
4   created_date      datetime
5   updated_date      datetime

In [21]:
#Review dataframe data types
basics_df.dtypes

tconst            object
primary_title     object
start_year       float64
runtime_mins       int64
dtype: object

In [22]:
#Load Basics table
basics_df.to_sql("basics", engine, index=False, if_exists='append')

86972

In [23]:
# Confirm data has been added
q = """
SELECT * FROM basics
LIMIT 5;
"""
pd.read_sql(q,engine)

,tconst,primary_title,start_year,runtime_mins,created_date,updated_date
0,tt0035423,Kate & Leopold,2001.0,118,2023-11-02 10:45:40,2023-11-02 10:45:40
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,2023-11-02 10:45:40,2023-11-02 10:45:40
2,tt0068865,Lives of Performers,2016.0,90,2023-11-02 10:45:40,2023-11-02 10:45:40
3,tt0069049,The Other Side of the Wind,2018.0,122,2023-11-02 10:45:40,2023-11-02 10:45:40
4,tt0088751,The Naked Monster,2005.0,100,2023-11-02 10:45:40,2023-11-02 10:45:40

#### Ratings Tables

In [24]:

q = """
DESCRIBE ratings;
"""
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,avg_rating,float,YES,,None,
1,num_votes,int,YES,,None,
2,date_created,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,date_update,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,tconst,char(15),NO,PRI,None,

#### Checking columns and names

In [25]:
#checking field names
describe['Field'].values

array(['avg_rating', 'num_votes', 'date_created', 'date_update', 'tconst'],
      dtype=object)

In [27]:
ratings_df.columns

Index(['Unnamed: 0', 'tconst', 'averageRating', 'numVotes'], dtype='object')

In [28]:
#Drop unused columns
ratings_df.drop(columns= ['Unnamed: 0'], 
            inplace = True, axis = 1)
ratings_df.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [31]:
#Rename column so names match
rename_ratings = {'averageRating':'avg_rating', 'numVotes':'num_votes'}
ratings_df = ratings_df.rename(rename_ratings, axis = 1)
ratings_df.head(1)

      tconst  avg_rating  num_votes
0  tt0035423         6.4      87153

#### Review datatypes

In [32]:
#Review SQL table data types
describe [['Field', 'Type']]

          Field      Type
0    avg_rating     float
1     num_votes       int
2  date_created  datetime
3   date_update  datetime
4        tconst  char(15)

In [33]:
ratings_df.dtypes

tconst         object
avg_rating    float64
num_votes       int64
dtype: object

In [34]:
#Load ratings table
ratings_df.to_sql("ratings", engine, index=False, if_exists='append')

71904

In [35]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

   avg_rating  num_votes        date_created         date_update     tconst
0         6.4      87153 2023-11-02 10:47:11 2023-11-02 10:47:11  tt0035423
1         6.4        175 2023-11-02 10:47:11 2023-11-02 10:47:11  tt0062336
2         5.4         74 2023-11-02 10:47:11 2023-11-02 10:47:11  tt0068865
3         6.7       7754 2023-11-02 10:47:11 2023-11-02 10:47:11  tt0069049
4         5.2        336 2023-11-02 10:47:11 2023-11-02 10:47:11  tt0088751

### Genres

In [36]:

q = """
DESCRIBE genres;
"""
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(20)  YES         None

In [37]:
# Confirm data has been added
q = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

### Title_genres

In [38]:

q = """
DESCRIBE title_genres;
"""
describe = pd.read_sql(q, engine)
describe

      Field      Type Null  Key Default Extra
0    tconst  char(15)   NO  PRI    None
1  genre_id       int   NO  PRI    None

In [39]:
# Confirm data has been added
q = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []